// 1. Використовуючи функцію if...else,
// напишіть код, який буде запитувати:
// "Яка офіційна назва JavaScript?"
// Якщо користувач вводить "ECMAScript",
// то показати через alert: "Вірно!"
// в протилежному випадку показати: "Не знаєте? ECMAScript!"
 
// const answer = prompt("Яка офіційна назва JavaScript?");

// if (answer === "ECMAScript") {
//     alert ("Вірно!")
// } else {
//     alert ("Не знаєте? ECMAScript!")
// }


// 2. Використовуючи конструкцію if..else, напишіть код, який отримує число через prompt, а потім виводить в alert:
// 1, якщо значення більше нуля,
// -1, якщо значення менше нуля,
// 0, якщо значення дорівнює нулю.
// Передбачається, що користувач вводить лише цифри.

// const answer = prompt("Введіть число");

// if (Number(answer) > 0 ) {
//     alert (1)
// } else if (Number(answer) < 0) {
//     alert (-1)
// } else {
//     alert (0)
// }

// 3. Перепишыть конструкцію if з використанням умовного оператора '?':

// const a = 1;
// const b = 2;
// let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Багато';
// }

// result = (a + b < 4) ? 'Мало' : 'Багато';
// console.log(result);

// 4. Напишіть програму, яка отримає від користувача
// число (кількість хвилин) і виведе до консолі
// Рядок у форматі годин і хвилин
// https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/padStart
// 70 === 01: 10

// const minutes = 70;
// const hours = minutes / 60;

// console.log(Math.floor(1.1));

// АБО
// console.log(minutes % 60);

// АБО


//5. Напишіть цикл, який виводить у консоль
// 5.1 числа від max до min за спаданням
// 5.2 Виведіть у консоль усіх парні числа від min до max
// const max = 50;
// const min = 23;

// for (i = max; i >= min; i -= 1){
//     if (i % 2 !== 0) {
//         continue;
//     }
//     console.log (i)
// }

// 8. При завантаженні сторінки користувачеві пропонується
// в prompt ввести число. Введення додається до значення
// змінної total.
// Операція введення числа продовжується доти,
// поки користувач не натисне кнопку Cancel в prompt.
// Після того як користувач припинив введення, натиснувши на
// кнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// 8.1 Зробити перевірку, що користувач ввів саме число,
// а не довільний набір символів.

//9. Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз і так далі.
// Цикл повинен запитувати число, поки користувач не
// введе число більше 100, або натисне кнопку
// Скасування в prompt


// 12. Напишіть через світч пошук автора мови програмування
// Пишемо назву мови у шаблонному рядку отримує відповідь: мова та автор
// PHP Расмус Лердорф
// C# група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота
// Swift Кріс Латтнер
// JS Брендан Ейх
// Java Джеймс Гослінг
// Python Гвідо ван Россум


//6. За допомогою циклу for додайте всі парні числа від min до max
//const max = 50;
//const min = 0;


//7. Напишіть код, який запитуватиме
// логін за допомогою prompt і буде виводити результат
// в консоль браузера

// Якщо користувач вводить "Адмін",
// то prompt запитує пароль.
// Якщо нічого не ввели або натиснута клавіша Esc
// вивести рядок "Скасовано"
// Інакше вивести рядок "Я вас не знаю"

//Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести рядок "Привіт!"
// інакше виводити рядок "Невірний пароль!"


